Revit 2024 API
AlignmentStationLabel Class
 Represents an object which provides access to a specialized Revit annotation element used for labeling Alignment stations.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public class AlignmentStationLabel
Visual Basic
Public Class AlignmentStationLabel
Visual C++
public ref class AlignmentStationLabel
Remarks
 The element is a SpotDimension. The element's category is OST_AlignmentStationLabels or, if in a set of labels, OST_AlignmentStationLabelSets. The element's type is a SpotDimensionType with DimensionStyleType equal to AlignmentStationLabel. The element's Origin is a point on the tessellated representation of an alignment. To get the precise point on the alignment's curve, use GetPointAtStation(Double) with input obtained from Station.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel
See Also
AlignmentStationLabel Members
Autodesk.Revit.DB.Infrastructure Namespace